<?php

App::uses('Helper', 'View');

class OlcHelper extends AppHelper {

    public $stages = array(
        '0' => '未登記',
        '1' => '已登記',
        '2' => '已當選',
    );
    public $party = array(
        '無' => '無',
        '' => '無',
        '中國國民黨' => '國',
        '民主進步黨' => '民',
        '中華統一促進黨' => '中統',
        '國' => '國',
        '中國青年黨' => '中青',
        '教科文預算保障e聯盟' => '教',
        '無黨團結聯盟' => '無團',
        '無政黨' => '無',
        '勞動黨' => '勞',
        '台灣團結聯盟' => '台聯',
        '親民黨' => '親',
        '新黨' => '新',
        '無黨籍' => '無',
        '民進黨' => '民',
        '人民民主陣線' => '民陣',
        '樹黨' => '樹',
        '基進側翼' => '基',
        '國民進步黨' => '國進',
        '綠黨' => '綠',
        '全民廉政無黨聯盟' => '全廉',
        '天宙和平統一家庭黨' => '天',
        '台灣民族黨' => '台民',
        '台灣第一民族黨' => '台一',
        '華聲黨' => '華',
        '人民最大黨' => '人',
        '中華民主向日葵憲政改革聯盟' => '民向',
        '台灣主義黨' => '台主',
        '臺灣建國黨' => '建國',
        '聯合黨' => '聯',
        '三等國民公義人權自救黨' => '三',
        '大道人民黨' => '大',
        '臺灣團結聯盟' => '台聯',
        '國民黨' => '國',
        '無黨' => '無',
    );

}
